package lr6.example1;

/*
Напишите программу с классом, в котором есть два поля:
символьное и текстовое. В классе должен быть перегруженный метод
для присваивания значений полям. Если метод вызывается с символьным аргументом,
то соответствующее значение присваивается символьному полю. Если метод
вызывается с текстовым аргументом, то он определяет значение текстового поля.
Методу аргументом также может передаваться символьный массив. Если массив
состоит из одного элемента, то он определяет значение символьного поля.
В противном случае (если в массиве больше одного элемента) из символов массива
формируется текстовая строка и присваивается значением текстовому полю.
 */
public class Main {
    public static void main(String[] args) {
        Task1 value = new Task1();
        value.setValue('s');
        value.setValue("I love class");
        value.showValue();
        char [] ch = {'a'};
        value.setValue(ch);
        char [] str = {'I','l', 'o', 'v', 'e'};
        value.setValue(str);
        value.showValue();
    }
}
